laRhea BL
                          laRhea BL
Speed Mix                 laRhea V+
                          Becher
platzieren                   Schaltet ein...
Bitte warten        Vorauswahl
-   Zucker   +           Becher
platzieren                   Getränk fertig
Becher entnehmen     Zubereitung
Getränk Nr. §1          §1
wird zubereitet                  Passenden
Betrag einwerfen          Brühgruppe
prüfen                   Programmierung
richtig              Programmierung
AUS                  1= KEY ---> VMC
2= VMC ---> KEY     Programmierung
Daten EPROM          Programmierung
RHEA-FLASH           Produk.auffüllen
§1                 -WASSERFILTER-
spuelen 10=START     Gerät
einsatzbereit                 Service
Karte                       Nicht verfügbar
                    Reset
Kaffeesatz=RESET              Reset
Kaffeesatz = P1                
                                  Guthaben:
§1                        außer Betrieb
wasserfilter          außer Betrieb
Brüher reinigen       Preis:     §1
                      außer Betrieb
Kaffeesatz            kein Produkt
                       füllt Wasser auf
bitte warten…      bitte warten…
                      bitte warten…
Temperatur            Außer Betrieb
AUS §1 §2             Gerät OFFLINE
§1:§2                 ................
Start      §1:§2   Testausgabe
                        Einen Moment
entspannen             Frische
Milch                       3  Meldung
programmierbare          gönne dir
eine Pause                Genießen Sie
eine Auszeit           Münzen einwerfen
                   t. inst.     §1
----------------    t.h §1  t.d §2
t.c §3               Kartenleser
nicht verbunden         Datenzugriff
bitte warten…          K ä n n c h e n
                    rheavendors
                        Becher
platzieren                   Keine Frisch
milch    OFF §1        HAPPY
HOUR                          Freiverkauf
§1                      Keine Bohnen
OFF §1                 mes 48
                             außer Betrieb
kein Wasser           Wasser fuellen
reset Taste 1        Hydrodynamic
Emptying phase         Automatische
Dampfreinigung         Wartung
                            ungültige Karte
Code  §1            1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=Spülen
7=Gr 8=BC 9=Desc         1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Spülen
8=BC                     1-4=Spülen
                         Spülen   §1
§2                      RFID Kartenleser
vorhanden          Hello      §1
§2-§3-§4 §5 §6:§7     Passenden Betrag
einwerfen          Wasserfilter
austauschen            Brühgruppe
reinigen                 Kaffeesatz-
Behälter leeren         SET  PRODUKT
---- OK ----           INSTALLATION
                       ende
installation                   Guthaben = 0
                       Karte
platzieren                    Auswahlkarte
                       Produktreserve
KAFFEE AUFFÜLLEN     nicht verfügbar
§1                  -   Zucker   +
                     Bitte Getränk
wählen                Tür-Modul
version    §1             Espresso-Modul
version    §1        Milch-Modul
version    §1           autom. Spülung
in    §1sek.          
OFF §1  §2                        Becher
entnehmen                    Bitte warten
Boiler heizt           Kundenkarte
ungültig                Gerätekarte
ungültig                Gute Wahl!
                         WERTMARKE
                          Bitte warten
Dampf Temp.            Preis :    §1
Budget: §2            First coffee
in progress            Kaffeesatz-
Behälter leeren         Tropfschale
entfernen               Tropfschale
einsetzen               Dampfspülung
10=START               Reiniger im Tank
fuellen 10=START   füllt Wasser…
conduc.=§1 uS         Kaltwass.im Tank
füllen 10=START    Spül.mit  Warm-
wasser  10=START    Milch-Modul
schaltet ein...         Milchcontainer
leer                 S T O P
                            RFID Karte
verweigert               Milch-Modul
reinigen                Reinigung mit
Mittel  10=START      Cyclic Test
round #§1               Cyclic Test
Stopped!!!              Spülung mit
Reinig. 10=START        ENDE Reinigung
mit Mittel           ENDE
Spülung m.Reinig               Milch-Modul
wird gereinigt          Becher
platzieren                   Einst. Mahlwerk
bitte warten…       §1
heißes Wasser                    Warnung Produkt
level  niedrig       
                                  Kaffee auffangen
PROG Taste          
autom. Neustart                   Ende
deinstallieren                 Final Result:§1
KEY PRESS <PROG>    UhrzeitReinigung
M-Modul aktual.    TEST  LÄUFT
BITTE WARTEN            bestatigen Teil-
Reset druck. P10   Starting Test
4=start PROG=end      TEST MOTOR - §1
sx §2  dx §3        TEST - §1  Tp: §2
up §3  dn §4      Final Result
TEST - §1              System gehalten
bitte Neustart!     Schmutzwasser-
tank entleeren       Schmutzwasser-
tank einsetzen       Spülung §1  §2
........uS=§3        Alle Tests OK?
>START/10            Clean.Deter.type
10=Tab 12=Liquid   prüfe Milch
                        Reiniger prüfen
der Mischung        MilchM Reinig.:
prüf. Reinig §1     Reinigen §1  §2
........uS=§3       Auflösen
Reiniger  §1 §2            setzen Milchsch-
lauch 10:ja 9:no   nachgefüllt
Milch 10:ja 9:no        prüfe Milch
vorhanden               prüfe Milch
Qualität                prüfe Milch
und reinige             rhMM1.v+ ?
B1=ja B2=nein            Reinige rhMM1.v
Zeit §1:§2 Ok=P1    MilchM Reinig.:
niedrig R.  §1      prüfe Temperatur
Milchtank          Verfügbar
                          Beende Kaffee
Taste <PROG>          Öffne Kaffee
Taste <PROG>           1/13 Rei. Mahlw.
1=Mahl1 2=Mahl2    2/13 Mahl§1 schl
ießen  10=ok       3/13 Br & Beh.
entfernen 10=ok      4/13 Aufsatz ein
setzen    10=ok    5/13 Mahlw.
reinigen10=start        Zyklus §1 von §2
                   6/13 Wdh. Reinig
10=ja andere=no    7/13 Aufsatz
entfernen  10=ok       8/13 B.behälter
einsetzen  10=ok    9/13 B.behälter
öffnen   10=ok      10/13 Kaffee
mahlen  10=start       Zyklus §1 von §2
timeout §3 sek     11/13 Wiederhole
10=ja andere=no    12/13 Brüher
zurück  10 = ok        13/13 Kaffee?
10=ja andere=no       ESPRESSO
wird zubereitet            demnächst
geplante Wartung          Wartung muss
erfolgen               Gewicht eingeben
1=speichern §1     Getränk fertig
Becher entnehmen     außer Betrieb
kein Wasser           Tasse platzieren
Klappe schließen   Tropfschale
entfernen               Tropfschale
einsetzen               Bitte Klappe
schließen              Milch-Modul
reinigen                Becher
platzieren                   Passenden
Betrag einwerfen          Brühgruppe
prüfen                   außer Betrieb
Brüher reinigen       ................
start      §1:§2   Testausgabe
                        Einen Moment
entspannen             Frischmilch
                        3  Meldung
programmierbar           ein Moment zum
Entspannen           Genießen Sie
eine Auszeit           Münzen bitte
einwerfen              Brühgruppe
reinigen                 Kaffeesatz-
Behälter leeren         ENDE
PROGRAMMIERUNG                 CODE EINGABE
nicht aktiv            uninstallation
läuft.....            
                                  Kalibrierung
nicht möglich          Brüher entnehm.
PROG   drücken      Brüher setzen
PROG  drücken         öffne Boilerhahn
10=start           PROG
Taste drücken                  Ende deinstallat
Boilierhahn zu     Wasser OK ?
10=start                Tropfschale ein-
gesetzt?10=start   Tropfschale ein-
gesetzt?10=start   Abfallbehälter
leer ? 10=start      Tropfschale
leer ?  10=start        FEHLERMELDUNGEN
                    FEHLERMELDUNGEN
                    -PROGRAMMIERUNG-
----------------   VORWAHL FUNKTION
nicht aktiv        PRODUKT §1
LAUFZEIT §2.§3           Zeit Dosierung
Mahlwerk §1  §2.§3   Zeit Dosierung
Mahlwerk    §1.§2    Gewic. eing.§1
1=speicher 2=Wdh     ml H2O eingeben
1=save 2=Wdh §1     Empties test jug
Test:  1=ok 2=no   füll H2O FM Tank
tube 1=ok 2=no     Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=Spülen
8=BC 9=Desc              1-4=Rinse 5=Milk
8=BC               1-4=Spülen
7=grinder 8=BC           1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Spülen 5=Mlk
6=D.M 7=Gr. 8=BC   1-4=Spülen 5=Mlk
6=Desc.Milk 8=BC   ENERGIESPARMODUS
                   Kredit:
Karte                       Karte bitte
vorhalten               Kalib. Mühle
erforderlich           Refill   cups
                      Use own cups
                       